tap "homebrew/bundle"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "jesseduffield/lazygit"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Bash Automated Testing System
brew "bats-core"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GitHub command-line tool
brew "gh"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Platform built on V8 to build network applications
brew "node@16"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Shell command parallelization utility
brew "parallel"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Cross-shell prompt for astronauts
brew "starship"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Prompt theme engine for any shell
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# Command-line interface for 1Password
cask "1password-cli"
# Modern programming language in the Lisp/Scheme family
cask "racket"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
