# Tap Homebrew
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jesseduffield/lazygit"

# Apps
cask "1password"
cask "1password-cli"
cask "anki"
cask "discord"
cask "firefox-developer-edition"
cask "racket"
cask "raycast"
cask "spotify"
cask "wezterm"

# System
brew "coreutils"
brew "fd"
brew "wget"
brew "git"
brew "ffmpeg"
brew "gh"
brew "gnu-tar"
brew "imagemagick"
brew "mas"
brew "neovim"
brew "nvm"
brew "openssl"
brew "parallel"
brew "ripgrep"
brew "starship"
brew "zsh-autosuggestions"
brew "jesseduffield/lazygit/lazygit"

# Languages
brew "node"
brew "python@3.11"
brew "ruby"

# Other
brew "exercism"

# Fonts
cask "font-monocraft"
cask "font-monaspace"

# App Store
mas "1Password for Safari", id: 1569813296
mas "Affinity Designer", id: 824171161
mas "Interactful", id: 1528095640
mas "Sip", id: 507257563
mas "Speedtest", id: 1153157709
mas "Xcode", id: 497799835
